Repository: littleseven/polang
Catalog: iosApp/PoLang/Resources/Localizable.xcstrings
Source language: en
Languages: es, fr, zh_hans, zh_hant

# filter_film_fuji
source: Film Fuji
es: Película Fuji
zh_hans: 富士胶片
zh_hant: 富士膠片

# filter_film_gold
source: Film Gold
es: Película dorada
fr: Film doré
zh_hans: 胶片金
zh_hant: 膠片金

# filter_leica_bw
source: Leica B&W
es: Leica B&N
fr: Leica N&B
zh_hans: 徕卡黑白
zh_hant: 徠卡黑白

# filter_leica_classic
source: Leica Classic
es: Leica clásico
fr: Leica Classique
zh_hans: 徕卡经典
zh_hant: 徠卡經典

# filter_leica_vibrant
source: Leica Vibrant
es: Leica vibrante
zh_hans: 徕卡生动
zh_hant: 徠卡生動

# filter_warm
source: Warm
es: Cálido
fr: Chaud
zh_hans: 暖色
zh_hant: 暖色

source: Gallery Cleanup
es: Limpieza de galería
fr: Nettoyage de la galerie
zh_hans: 相册整理
zh_hant: 相簿整理

# gallery_group_landscape
source: Landscape
es: Paisaje
fr: Paysage
zh_hans: 风景
zh_hant: 風景

# gallery_group_no_face
source: No faces
es: Sin rostros
fr: Sans visage
zh_hans: 无人脸
zh_hant: 無人臉

# gallery_group_no_location
source: No location
es: Sin ubicación
fr: Sans lieu
zh_hans: 无位置
zh_hant: 無位置

# gallery_group_person_label
source: Person
es: Persona
fr: Personne
zh_hans: 人物
zh_hant: 人物

# gallery_group_person_none
source: Ungrouped (no face / not clustered)
es: Sin agrupar (sin rostro / sin clúster)
fr: Non groupées (sans visage / pas de cluster)
zh_hans: 未分组（无人脸/未聚类）
zh_hant: 未分組（無人臉/未聚類）

# gallery_group_with_face
source: With faces
es: Con rostros
fr: Avec visage
zh_hans: 含人脸
zh_hant: 含人臉

# gallery_people_entry
source: People
es: Personas
fr: Personnes
zh_hans: 人物
zh_hant: 人物

# gallery_search_hint
source: Search by content, location, text…
es: Buscar por contenido, ubicación, texto…
fr: Rechercher par contenu, lieu, texte…
zh_hans: 按内容、地点、文字搜索…
zh_hant: 按內容、地點、文字搜尋…

# gallery_search_no_result_with_query
source: No photos matching "%@"
es: No hay fotos que coincidan con "%@"
fr: Aucune photo ne correspond à « %@ »
zh_hans: 未找到匹配 "%@" 的照片
zh_hant: 未找到符合「%@」的照片

# gallery_search_results_title
source: Search "%@" (%lld photos)
es: Buscar "%@" (%lld fotos)
fr: Rechercher « %@ » (%lld photos)
zh_hans: 搜索 "%@"（%lld 张）
zh_hant: 搜尋 "%@"（%lld 張）

source: iOS supports Florence-2 only. Qwen3-VL tagging is unavailable on iOS; selecting it falls back to Florence-2.
es: iOS solo es compatible con Florence-2. El etiquetado con Qwen3-VL no está disponible en iOS; si lo seleccionas, se usará Florence-2.
fr: iOS ne prend en charge que Florence-2. L'étiquetage Qwen3-VL n'est pas disponible sur iOS ; le sélectionner revient à utiliser Florence-2.
zh_hans: iOS 仅支持 Florence-2。Qwen3-VL 打标在 iOS 不可用，选择后回退到 Florence-2。
zh_hant: iOS 僅支援 Florence-2。Qwen3-VL 打標在 iOS 不可用，選擇後回退到 Florence-2。

source: iOS uses a single fixed pipeline (CPU only). Per-stage models, GPU and interval profiles are not configurable on iOS.
es: iOS usa un único flujo de procesamiento fijo (solo CPU). Los modelos por etapa, la GPU y los perfiles de intervalo no son configurables en iOS.
fr: iOS utilise un pipeline unique et fixe (CPU uniquement). Les modèles par étape, le GPU et les profils d'intervalle ne sont pas configurables sur iOS.
zh_hans: iOS 使用固定单一管线（仅 CPU），不支持阶段独立模型、GPU 与间隔档位配置。
zh_hant: iOS 使用固定單一管線（僅 CPU），不支援階段獨立模型、GPU 與間隔檔位配置。

# id_photo_color_blue
source: Blue
es: Azul
fr: Bleu
zh_hans: 标准蓝
zh_hant: 標準藍

# id_photo_color_red
source: Red
es: Rojo
fr: Rouge
zh_hans: 标准红
zh_hant: 標準紅

# id_photo_color_white
source: White
es: Blanco
fr: Blanc
zh_hans: 白
zh_hant: 白

# id_photo_drag_hint
source: Drag or pinch to adjust framing
es: Arrastra o pellizca para ajustar el encuadre
fr: Faites glisser ou pincez pour ajuster le cadrage
zh_hans: 拖动或双指缩放调整构图
zh_hant: 拖動或雙指縮放調整構圖

# id_photo_edge_contrast
source: Edge contrast
es: Contraste del borde
fr: Contraste des bords
zh_hans: 边缘对比度
zh_hant: 邊緣對比度

# id_photo_edge_feather
source: Feather
es: Difuminado
fr: Adoucissement
zh_hans: 羽化
zh_hant: 羽化

# id_photo_edge_reset
source: Reset
es: Restablecer
fr: Réinitialiser
zh_hans: 重置参数
zh_hant: 重設參數

# id_photo_edge_shrink_expand
source: Shrink / Expand
es: Reducir / Ampliar
fr: Réduire / Agrandir
zh_hans: 收缩 / 扩张
zh_hant: 收縮 / 擴張

# id_photo_matting_failed
source: Portrait matting failed
es: Error al recortar el retrato
fr: Échec du détourage du portrait
zh_hans: 人像抠图失败
zh_hant: 人像去背失敗

# id_photo_repair_brush_size
source: Brush size
es: Tamaño del pincel
fr: Taille du pinceau
zh_hans: 笔刷大小
zh_hant: 筆刷大小

# id_photo_repair_clear
source: Clear strokes
es: Eliminar trazos
fr: Effacer les traits
zh_hans: 清除描边
zh_hant: 清除筆畫

# id_photo_repair_erase
source: Erase
es: Borrar
fr: Effacer
zh_hans: 擦除
zh_hant: 擦除

# id_photo_repair_hint
source: Paint on the photo to restore or erase areas
es: Pinta sobre la foto para restaurar o borrar zonas
fr: Peignez sur la photo pour restaurer ou effacer des zones
zh_hans: 在照片上涂抹，恢复或擦除局部区域
zh_hant: 在照片上塗抹，恢復或擦除局部區域

# id_photo_repair_redo
source: Redo
es: Rehacer
fr: Rétablir
zh_hans: 重做
zh_hant: 重做

# id_photo_repair_restore
source: Restore
es: Restaurar
fr: Restaurer
zh_hans: 恢复
zh_hant: 恢復

# id_photo_repair_soft_edge
source: Soft edge
es: Borde suave
fr: Bord doux
zh_hans: 软边
zh_hant: 軟邊

# id_photo_repair_undo
source: Undo
es: Deshacer
fr: Annuler
zh_hans: 撤销
zh_hant: 復原

# id_photo_size_1in
source: 1 inch
es: 1 pulgada
fr: 1 pouce
zh_hans: 1寸
zh_hant: 1寸

# id_photo_size_2in
source: 2 inch
es: 2 pulgadas
fr: 2 pouces
zh_hans: 2寸
zh_hant: 2寸

# id_photo_size_small_1in
source: Small 1 inch
es: 1 pulgada pequeña
fr: Petit 1 pouce
zh_hans: 小1寸
zh_hant: 小1寸

# id_photo_size_small_2in
source: Small 2 inch
es: 2 pulgadas pequeñas
fr: Petit 2 pouces
zh_hans: 小2寸
zh_hant: 小2寸

# id_photo_tab_edge
source: Edge
es: Borde
fr: Bords
zh_hans: 边缘
zh_hant: 邊緣

# id_photo_tab_repair
source: Repair
es: Retoque
fr: Retouche
zh_hans: 修补
zh_hant: 修補

# id_photo_tab_size
source: Size
es: Tamaño
fr: Taille
zh_hans: 尺寸
zh_hant: 尺寸

# id_photo_title
source: ID Photo
es: Foto tipo carné
fr: Photo d'identité
zh_hans: 证件照
zh_hant: 證件照

# landmark_loading
source: Detecting face landmarks…
es: Detectando puntos del rostro…
fr: Détection des points de repère du visage…
zh_hans: 正在检测人脸关键点…
zh_hant: 正在檢測人臉關鍵點…

# landmark_no_face_detected
source: No face detected
es: No se detectó ningún rostro
fr: Aucun visage détecté
zh_hans: 未检测到人脸
zh_hant: 未檢測到人臉

source: lines
es: líneas
fr: lignes
zh_hans: 行
zh_hant: 行

# media_state_selected
source: Selected
es: Seleccionado
fr: Sélectionné
zh_hans: 已选择
zh_hant: 已選擇

# media_state_unselected
source: Not selected
es: No seleccionado
fr: Non sélectionné
zh_hans: 未选择
zh_hant: 未選擇

# media_type_photo
source: Photo
es: Foto
zh_hans: 照片
zh_hant: 照片

# media_type_video
source: Video
es: Vídeo
fr: Vidéo
zh_hans: 视频
zh_hant: 影片

# memory_detail_all
source: All
es: Todas
fr: Toutes
zh_hans: 全部
zh_hant: 全部

# memory_detail_best
source: Best
es: Destacadas
fr: Sélection
zh_hans: 精选
zh_hant: 精選

# memory_detail_empty
source: This memory is no longer available
es: Este recuerdo ya no está disponible
fr: Ce souvenir n'est plus disponible
zh_hans: 这条回忆已不可用
zh_hant: 這則回憶已不可用

# memory_empty_page
source: Memories will appear as your photo library grows
es: Los recuerdos aparecerán a medida que crezca tu fototeca
fr: Les souvenirs apparaîtront au fur et à mesure de votre photothèque
zh_hans: 照片积累后会自动生成回忆
zh_hant: 照片累積後會自動生成回憶

# memory_hide
source: Hide this memory
es: Ocultar este recuerdo
fr: Masquer ce souvenir
zh_hans: 隐藏这条回忆
zh_hant: 隱藏這則回憶

# memory_hide_cancel
source: Cancel
es: Cancelar
fr: Annuler
zh_hans: 取消
zh_hant: 取消

# memory_hide_confirm
source: Hide this memory? It will no longer be shown.
es: ¿Ocultar este recuerdo? Ya no se mostrará.
fr: Masquer ce souvenir ? Il ne sera plus affiché.
zh_hans: 隐藏这条回忆？隐藏后将不再显示。
zh_hant: 隱藏這則回憶？隱藏後將不再顯示。

# memory_items_count
source: %1$d items
es: %1$d elementos
fr: %1$d éléments
zh_hans: %1$d 项
zh_hant: %1$d 項

# memory_on_this_day
source: On this day
es: Un día como hoy
fr: Ce jour-là
zh_hans: 那年今日
zh_hant: 那年今日

# memory_person_title
source: Moments with %1$@
es: Momentos con %1$@
fr: Moments avec %1$@
zh_hans: 与 %1$@ 的时刻
zh_hant: 與 %1$@ 的時刻

# memory_photo_cd
source: Memory photo %1$d
es: Foto del recuerdo %1$d
fr: Photo du souvenir %1$d
zh_hans: 回忆照片 %1$d
zh_hant: 回憶照片 %1$d

# memory_photo_count
source: %1$d photos
es: %1$d fotos
zh_hans: %1$d 张照片
zh_hant: %1$d 張照片

# memory_privacy_note
source: On-device · private
es: En el dispositivo · privado
fr: Sur l'appareil · privé
zh_hans: 端侧生成 · 私密
zh_hant: 端側生成 · 私密

# memory_recent_highlights
source: Recent highlights
es: Momentos destacados recientes
fr: Temps forts récents
zh_hans: 近期高光
zh_hant: 近期精選

# memory_recent_highlights_subtitle
source: Past 30 days
es: Últimos 30 días
fr: 30 derniers jours
zh_hans: 近 30 天
zh_hant: 近 30 天

# memory_section_journey
source: Journeys
es: Viajes
fr: Voyages
zh_hans: 旅程
zh_hant: 旅程

# memory_section_people
source: People
es: Personas
fr: Personnes
zh_hans: 人物
zh_hant: 人物

# memory_section_time
source: Time
es: Momentos
fr: Temps
zh_hans: 时光
zh_hant: 時光

# memory_share
source: Share memory
es: Compartir recuerdo
fr: Partager le souvenir
zh_hans: 分享回忆
zh_hant: 分享回憶

# memory_title
source: Memories
es: Recuerdos
fr: Souvenirs
zh_hans: 回忆
zh_hant: 回憶

source: not downloaded
es: no descargado
fr: non téléchargé
zh_hans: 个未下载
zh_hant: 個未下載

# ocr.no.text
source: No text recognized.
es: No se reconoció texto.
fr: Aucun texte reconnu.
zh_hans: 未识别到文字
zh_hant: 未識別到文字

# org_ai_preselect_off
source: AI preselect off
es: Preselección de IA desactivada
fr: Présélection IA désactivée
zh_hans: AI 预选已关闭
zh_hant: AI 預選已關閉

# org_ai_preselect_on
source: AI preselect on
es: Preselección de IA activada
fr: Présélection IA activée
zh_hans: AI 预选已开启
zh_hant: AI 預選已開啟

# org_ai_preselected
source: %1$d AI-preselected
es: %1$d preseleccionados por IA
fr: %1$d présélectionnés par l'IA
zh_hans: AI 已预选 %1$d 项
zh_hant: AI 已預選 %1$d 項

# org_cat_blurry
source: Blurry & low quality
es: Borrosas y de baja calidad
fr: Floues et de basse qualité
zh_hans: 模糊与低质量
zh_hant: 模糊與低品質

# org_cat_documents
source: Documents & receipts
es: Documentos y recibos
fr: Documents et reçus
zh_hans: 文档与票据
zh_hant: 文件與票據

# org_cat_duplicates
source: Duplicates & similar
es: Duplicados y similares
fr: Doublons et similaires
zh_hans: 重复与相似照片
zh_hant: 重複與相似照片

# org_cat_large_files
source: Large files
es: Archivos grandes
fr: Fichiers volumineux
zh_hans: 大文件
zh_hant: 大型檔案

# org_cat_meta
source: %1$d items · %2$@
es: %1$d elementos · %2$@
fr: %1$d éléments · %2$@
zh_hans: %1$d 个项目 · %2$@
zh_hant: %1$d 個項目 · %2$@

# org_cat_portraits
source: Low-quality portraits
es: Retratos de baja calidad
fr: Portraits de basse qualité
zh_hans: 低质量人像
zh_hant: 低品質人像

# org_cat_reclaim
source: Free %1$@
es: Libera %1$@
fr: Libérer %1$@
zh_hans: 可释放 %1$@
zh_hant: 可釋放 %1$@

# org_cat_screen_content
source: Screenshots & recordings
es: Capturas y grabaciones
fr: Captures et enregistrements
zh_hans: 截图与录屏
zh_hant: 截圖與錄影

# org_categories
source: Categories
es: Categorías
fr: Catégories
zh_hans: 类目
zh_hant: 類別

# org_cleaned_freed
source: %1$@ freed
es: %1$@ liberados
fr: %1$@ libérés
zh_hans: 已释放 %1$@
zh_hant: 已釋放 %1$@

# org_cleaned_meta
source: %1$d items moved to Trash
es: %1$d elementos movidos a la papelera
fr: %1$d éléments déplacés vers la corbeille
zh_hans: 已将 %1$d 个项目移入回收站
zh_hant: 已將 %1$d 個項目移入回收站

# org_cleaned_title
source: All clean!
es: ¡Todo limpio!
fr: Tout est propre !
zh_hans: 全部清理完成！
zh_hant: 全部清理完成！

# org_confidence_high
source: %1$d confident
es: %1$d fiables
fr: %1$d fiables
zh_hans: %1$d 高置信
zh_hant: %1$d 高信心

# org_confidence_review
source: %1$d to review
es: %1$d por revisar
fr: %1$d à vérifier
zh_hans: %1$d 待确认
zh_hant: %1$d 待確認

# org_empty_category
source: Nothing to clean here
es: Nada que limpiar aquí
fr: Rien à nettoyer ici
zh_hans: 这里无需清理
zh_hant: 這裡無需清理

# org_hero_across
source: Across %1$d categories
es: En %1$d categorías
fr: Sur %1$d catégories
zh_hans: 覆盖 %1$d 个类目
zh_hant: 涵蓋 %1$d 個類別

# org_hero_label
source: Estimated reclaimable
es: Espacio recuperable estimado
fr: Espace récupérable estimé
zh_hans: 预计可释放
zh_hant: 預計可釋放

# org_hero_review
source: %1$d more to review
es: %1$d más por revisar
fr: %1$d de plus à vérifier
zh_hans: 另有 %1$d 张待确认
zh_hant: 另有 %1$d 項待確認

# org_move_to_trash
source: Move to trash %1$d items · Free %2$@
es: Mover a la papelera %1$d elementos · Liberar %2$@
fr: Déplacer vers la corbeille %1$d éléments · Libérer %2$@
zh_hans: 移入回收站 %1$d 个项目 · 释放 %2$@
zh_hant: 移入回收站 %1$d 個項目 · 釋放 %2$@

# org_needs_scan
source: Scan needed · tap to scan
es: Escaneo necesario
fr: Analyse requise
zh_hans: 需先扫描 · 点击前往
zh_hant: 需先掃描 · 點擊前往

# org_partial_trash
source: Some items need extra permission and were kept
es: Algunos elementos necesitan permiso adicional y se conservaron
fr: Certains éléments nécessitent une autorisation supplémentaire et ont été conservés
zh_hans: 部分项目需要额外授权，已保留
zh_hant: 部分項目需要額外授權，已保留

# org_privacy_note
source: All analysis runs on-device · your photos never leave this phone
es: Todo el análisis se ejecuta en el dispositivo · tus fotos nunca salen de este teléfono
fr: Toute l'analyse s'exécute sur l'appareil · vos photos ne quittent jamais ce téléphone
zh_hans: 所有分析均在设备端完成 · 照片不会离开此手机
zh_hant: 所有分析皆在裝置端完成 · 照片不會離開此手機

# org_protected_badge
source: Possibly precious photo
es: Foto posiblemente valiosa
fr: Photo probablement précieuse
zh_hans: 可能是珍贵照片
zh_hant: 可能是珍貴照片

# org_protected_count
source: %1$d protected
es: %1$d protegidos
fr: %1$d protégés
zh_hans: %1$d 受保护
zh_hant: %1$d 受保護

# org_quick_tidy
source: Swipe to tidy
es: Desliza para ordenar
fr: Glisser pour trier
zh_hans: 滑动整理
zh_hant: 滑動整理

# org_section_protected
source: Likely precious (%1$d)
es: Posiblemente valiosas (%1$d)
fr: Probablement précieuses (%1$d)
zh_hans: 可能是珍贵照片（%1$d）
zh_hant: 可能是珍貴照片（%1$d）

# org_section_review
source: Review (%1$d)
es: Revisar (%1$d)
fr: À vérifier (%1$d)
zh_hans: 请确认（%1$d）
zh_hant: 請確認（%1$d）

# org_section_suggested
source: Suggested (%1$d)
es: Sugeridos (%1$d)
fr: Suggérés (%1$d)
zh_hans: 建议删除（%1$d）
zh_hant: 建議刪除（%1$d）

# org_title
source: Organize
es: Organizar
fr: Organiser
zh_hans: 整理
zh_hant: 整理

# org_trash_note
source: Items stay in Trash for 30 days
es: Los elementos permanecen en la papelera 30 días
fr: Les éléments restent dans la corbeille pendant 30 jours
zh_hans: 项目将在回收站保留 30 天
zh_hant: 項目將在回收站保留 30 天

# org_undo
source: Undo
es: Deshacer
fr: Annuler
zh_hans: 撤销
zh_hant: 復原

# people_photos_count
source: %lld photos
es: %lld fotos
zh_hans: %lld 张
zh_hant: %lld 張

source: photos
es: fotos
zh_hans: 张照片
zh_hant: 張照片

# preview_swipe_delete_hint
source: Release to move to Trash
es: Suelta para mover a la papelera
fr: Relâchez pour mettre à la corbeille
zh_hans: 松开移入回收站
zh_hant: 鬆開移入回收站

source: required models,
es: modelos requeridos,
fr: modèles requis,
zh_hans: 个必须模型，
zh_hant: 個必須模型，

# scan_action_cancel
source: Cancel
es: Cancelar
fr: Annuler
zh_hans: 取消
zh_hant: 取消

# scan_action_full
source: Full
es: Completo
fr: Complète
zh_hans: 全量
zh_hant: 全量

# scan_action_pause
source: Pause
es: Pausar
zh_hans: 暂停
zh_hant: 暫停

# scan_action_resume
source: Resume
es: Reanudar
fr: Reprendre
zh_hans: 继续
zh_hant: 繼續

# scan_action_retry
source: Retry failed
es: Reintentar fallidos
fr: Réessayer les échecs
zh_hans: 重试失败
zh_hant: 重試失敗

# scan_action_scan_full
source: Scan all
es: Escanear todo
fr: Tout analyser
zh_hans: 全量扫描
zh_hant: 全量掃描

# scan_action_scan_incremental
source: Scan new
es: Escanear nuevas
fr: Analyser les nouveautés
zh_hans: 增量扫描
zh_hant: 增量掃描

# scan_aesthetic_desc
source: Score photo aesthetics for best-cover selection.
es: Puntúa la estética de las fotos para elegir la mejor portada.
fr: Évalue l'esthétique des photos pour sélectionner la meilleure couverture.
zh_hans: 美学评分，用于封面挑选。
zh_hant: 美學評分，用於封面挑選。

# scan_aesthetic_title
source: Aesthetic score
es: Puntuación estética
fr: Score esthétique
zh_hans: 美学评分
zh_hant: 美學評分

# scan_cat_activity
source: Activity
es: Actividad
fr: Activité
zh_hans: 活动
zh_hant: 活動

# scan_cat_face
source: Face
es: Rostro
fr: Visage
zh_hans: 人脸
zh_hant: 人臉

# scan_cat_label
source: TAG categories
es: Categorías de etiquetas
fr: Catégories d'étiquettes
zh_hans: 选择 TAG 类别
zh_hant: 選擇 TAG 類別

# scan_cat_objects
source: Objects
es: Objetos
fr: Objets
zh_hans: 物体
zh_hant: 物體

# scan_cat_scene
source: Scene
es: Escena
fr: Scène
zh_hans: 场景
zh_hant: 場景

# scan_cat_summary
source: Summary
es: Resumen
fr: Résumé
zh_hans: 摘要
zh_hant: 摘要

# scan_cat_tags
source: Tags
es: Etiquetas
fr: Étiquettes
zh_hans: 标签
zh_hant: 標籤

# scan_col_done
source: Done
es: Hecho
fr: Terminé
zh_hans: 已完成
zh_hant: 已完成

# scan_col_pending
source: Pending
es: Pendiente
fr: En attente
zh_hans: 待处理
zh_hant: 待處理

# scan_col_stage
source: Stage
es: Etapa
fr: Étape
zh_hans: 阶段
zh_hant: 階段

# scan_coming_soon_toast
source: This feature arrives in a later version.
es: Esta función llegará en una versión posterior.
fr: Cette fonctionnalité arrivera dans une prochaine version.
zh_hans: 该功能在后续版本
zh_hant: 該功能在後續版本

# scan_db_stats_title
source: Database statistics
es: Estadísticas de la base de datos
fr: Statistiques de la base de données
zh_hans: 数据库累计统计
zh_hant: 資料庫累計統計

# scan_eta_prefix
source: ETA
es: Tiempo estimado
fr: Temps restant
zh_hans: 预计剩余
zh_hant: 預計剩餘

# scan_fine_control_title
source: Fine control
es: Control fino
fr: Contrôle fin
zh_hans: 精细控制
zh_hant: 精細控制

# scan_mode_full
source: Mode: full regenerate
es: Modo: regeneración completa
fr: Mode : régénération complète
zh_hans: 模式：全量重标
zh_hant: 模式：全量重標

# scan_mode_inc
source: fill missing only
es: completar solo lo que falta
fr: compléter uniquement les manquants
zh_hans: 仅补充缺失
zh_hant: 僅補充缺失

# scan_models_needed_msg
source: Download the face-embedding (glintr100) and semantic (mobileclip) models in Settings → Model Center first, then retry.
es: Descarga primero los modelos de embeddings faciales (glintr100) y semántico (mobileclip) en Ajustes → Centro de modelos, y vuelve a intentarlo.
fr: Téléchargez d'abord les modèles d'embeddings faciaux (glintr100) et sémantique (mobileclip) dans Réglages → Centre de modèles, puis réessayez.
zh_hans: 扫描需要先在「设置 → Model Center」下载 人脸嵌入(glintr100) 与 语义(mobileclip) 模型，下载后重试。
zh_hant: 掃描需要先在「設定 → Model Center」下載 人臉嵌入(glintr100) 與 語意(mobileclip) 模型，下載後重試。

# scan_models_needed_title
source: Models required
es: Modelos requeridos
fr: Modèles requis
zh_hans: 需要下载模型
zh_hant: 需要下載模型

# scan_page_title
source: TAG Generation Control
es: Control de generación de etiquetas
fr: Contrôle de la génération d'étiquettes
zh_hans: TAG 生成控制
zh_hant: TAG 生成控制

# scan_pass1_desc
source: Detect faces; generate 512-d embeddings & semantic vectors.
es: Detecta rostros; genera embeddings de 512 dimensiones y vectores semánticos.
fr: Détecte les visages ; génère des embeddings 512-d et des vecteurs sémantiques.
zh_hans: 检测人脸，生成 512 维嵌入与语义向量。
zh_hant: 偵測人臉，產生 512 維嵌入與語意向量。

# scan_pass1_title
source: Pass 1 · Faces
es: Paso 1 · Rostros
fr: Passe 1 · Visages
zh_hans: 阶段1·人脸
zh_hant: 階段1·人臉

# scan_pass2_desc
source: Cluster faces into people.
es: Agrupa rostros en personas.
fr: Regroupe les visages par personne.
zh_hans: 人脸聚类为人物。
zh_hant: 人臉聚類為人物。

# scan_pass2_title
source: Pass 2 · Clustering
es: Paso 2 · Agrupación
fr: Passe 2 · Regroupement
zh_hans: 阶段2·聚类
zh_hant: 階段2·聚類

# scan_pass3_desc
source: Understand image content & generate tags.
es: Comprende el contenido de la imagen y genera etiquetas.
fr: Comprend le contenu des images et génère les étiquettes.
zh_hans: 理解图像内容并生成标签。
zh_hant: 理解影像內容並產生標籤。

# scan_pass3_title
source: Pass 3 · Tagging
es: Paso 3 · Etiquetado
fr: Passe 3 · Étiquetage
zh_hans: 阶段3·打标
zh_hant: 階段3·打標

# scan_pass_stage_content
source: Content tags
es: Etiquetas de contenido
fr: Étiquettes de contenu
zh_hans: 内容打标
zh_hant: 內容打標

# scan_pass_stage_face
source: Face detection
es: Detección de rostros
fr: Détection des visages
zh_hans: 人脸检测
zh_hant: 人臉偵測

# scan_passctl_sub
source: Each stage can be incrementally added or fully regenerated.
es: Cada etapa se puede añadir de forma incremental o regenerar por completo.
fr: Chaque étape peut être complétée de manière incrémentielle ou entièrement régénérée.
zh_hans: 每个阶段均可独立增量补充或全量重新生成。
zh_hant: 每個階段均可獨立增量補充或全量重新生成。

# scan_passctl_title
source: Per-stage control
es: Control por etapa
fr: Contrôle par étape
zh_hans: 分阶段独立控制
zh_hant: 分階段獨立控制

# scan_pipeline_cluster
source: Person clustering
es: Agrupación de personas
fr: Regroupement des personnes
zh_hans: 人物聚类
zh_hant: 人物聚類

# scan_pipeline_content
source: Content tagging
es: Etiquetado de contenido
fr: Étiquetage du contenu
zh_hans: 内容打标
zh_hant: 內容打標

# scan_pipeline_face
source: Face detection
es: Detección de rostros
fr: Détection des visages
zh_hans: 人脸检测
zh_hant: 人臉偵測

# scan_pipeline_overview_title
source: Pipeline overview
es: Vista general del procesamiento
fr: Aperçu du pipeline
zh_hans: 处理阶段概览
zh_hant: 處理階段概覽

# scan_progress_summary
source: Task %1$d/%2$d done · pending %3$d · failed %4$d
es: Tarea %1$d/%2$d completada · pendientes %3$d · fallidas %4$d
fr: Tâche %1$d/%2$d terminée · %3$d en attente · %4$d échecs
zh_hans: 任务 %1$d/%2$d 完成 · 待处理 %3$d · 失败 %4$d
zh_hant: 任務 %1$d/%2$d 完成 · 待處理 %3$d · 失敗 %4$d

# scan_range_30d
source: 30d
es: 30 días
fr: 30 j
zh_hans: 30天
zh_hant: 30天

# scan_range_7d
source: 7d
es: 7 días
fr: 7 j
zh_hans: 7天
zh_hant: 7天

# scan_range_90d
source: 90d
es: 90 días
fr: 90 j
zh_hans: 90天
zh_hant: 90天

# scan_range_all
source: All
es: Todo
fr: Tout
zh_hans: 全部
zh_hant: 全部

# scan_range_label
source: Time range
es: Rango de tiempo
fr: Période
zh_hans: 时间范围
zh_hant: 時間範圍

# scan_regenerate_selected
source: Regenerate selected
es: Regenerar lo seleccionado
fr: Régénérer la sélection
zh_hans: 按选择重新生成
zh_hant: 依選擇重新產生

# scan_resume_unfinished
source: A previous scan did not finish.
es: Un escaneo anterior no finalizó.
fr: Une analyse précédente n'est pas terminée.
zh_hans: 上次的扫描未完成
zh_hant: 上次的掃描未完成

# scan_stat_embedding_count
source: Face vectors
es: Vectores faciales
fr: Vecteurs faciaux
zh_hans: 人脸向量
zh_hant: 人臉向量

# scan_stat_named_person_count
source: Named
es: Con nombre
fr: Nommées
zh_hans: 已命名人
zh_hant: 已命名人

# scan_stat_person_count
source: People
es: Personas
fr: Personnes
zh_hans: 人物
zh_hant: 人物

# scan_stat_total
source: Photos
es: Fotos
zh_hans: 照片
zh_hant: 照片

# scan_stat_with_face
source: With face
es: Con rostro
fr: Avec visage
zh_hans: 含人脸
zh_hant: 含人臉

# scan_stat_with_semantic
source: With semantic
es: Con semántica
fr: Avec sémantique
zh_hans: 语义向量
zh_hant: 語意向量

# scan_state_cancelled
source: Cancelled
es: Cancelado
fr: Annulée
zh_hans: 已取消
zh_hant: 已取消

# scan_state_cancelling
source: Cancelling
es: Cancelando
fr: Annulation
zh_hans: 取消中
zh_hant: 取消中

# scan_state_completed
source: Completed
es: Completado
fr: Terminée
zh_hans: 已完成
zh_hant: 已完成

# scan_state_idle
source: Idle
es: Inactivo
fr: Inactive
zh_hans: 待机
zh_hant: 待機

# scan_state_paused
source: Paused
es: Pausado
fr: En pause
zh_hans: 已暂停
zh_hant: 已暫停

# scan_state_pausing
source: Pausing
es: Pausando
fr: Mise en pause
zh_hans: 暂停中
zh_hant: 暫停中

# scan_state_running
source: Scanning
es: Escaneando
fr: Analyse en cours
zh_hans: 扫描中
zh_hant: 掃描中

# scan_sub_face
source: Faces & people
es: Rostros y personas
fr: Visages et personnes
zh_hans: 人脸与人物
zh_hant: 人臉與人物

# scan_sub_media
source: Media
es: Multimedia
fr: Médias
zh_hans: 媒体总量
zh_hant: 媒體總量

# scan_sub_stage
source: Stage progress
es: Progreso de etapas
fr: Progression des étapes
zh_hans: 阶段进度
zh_hant: 階段進度

# style_crosshatch
source: Crosshatch
es: Sombreado cruzado
fr: Hachures croisées
zh_hans: 交叉影线
zh_hant: 交叉影線

# style_emboss
source: Emboss
es: Relieve
fr: Relief
zh_hans: 浮雕
zh_hant: 浮雕

# style_posterize
source: Posterize
es: Posterizar
fr: Postérisation
zh_hans: 色调分离
zh_hant: 色調分離

# style_sketch
source: Sketch
es: Boceto
fr: Croquis
zh_hans: 素描
zh_hant: 素描

# style_toon
source: Toon
es: Caricatura
fr: Cartoon
zh_hans: 卡通
zh_hant: 卡通
